flimmy78/MXN003_FACTORY/nRF5_SDK_12.3.0_d7731ad/nRF5_SDK_12.3.0_d7731ad/examples/ble_peripheral/freertos_mxn003/main.c
#define VOI_INTERVAL_INTERVAL             300                              /**< RR interval interval (ms). */
#define MIN_VOI_INTERVAL                  100                              /**< Minimum RR interval as returned by the simulated measurement function. */
#define MAX_VOI_INTERVAL                  500                              /**< Maximum RR interval as returned by the simulated measurement function. */
#define VOI_INTERVAL_INCREMENT            1 

#define UART_INTERVAL_INTERVAL             3000                              /**< RR interval interval (ms). */
#define MIN_UART_INTERVAL                  100                              /**< Minimum RR interval as returned by the simulated measurement function. */
#define MAX_UART_INTERVAL                  500                              /**< Maximum RR interval as returned by the simulated measurement function. */
#define UART_INTERVAL_INCREMENT            1 


#define SENSOR_CONTACT_DETECTED_INTERVAL 5000                             /**< Sensor Contact Detected toggle interval (ms). */

#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(400, UNIT_1_25_MS)            /**< Minimum acceptable connection interval (0.1 seconds). */
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(600, UNIT_1_25_MS)            /**< Maximum acceptable connection interval (0.2 second). */
#define SLAVE_LATENCY                   0                                           /**< Slave latency. */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)             /**< Connection supervisory timeout (4 seconds). */

#define FIRST_CONN_PARAMS_UPDATE_DELAY   5000                             /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY    30000                            /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT     3                                /**< Number of attempts before giving up the connection parameter negotiation. */

#define SEC_PARAM_BOND                   1                                /**< Perform bonding. */
#define SEC_PARAM_MITM                   0                                /**< Man In The Middle protection not required. */
#define SEC_PARAM_LESC                   0                                /**< LE Secure Connections not enabled. */
#define SEC_PARAM_KEYPRESS               0                                /**< Keypress notifications not enabled. */
#define SEC_PARAM_IO_CAPABILITIES        BLE_GAP_IO_CAPS_NONE             /**< No I/O capabilities. */
#define SEC_PARAM_OOB                    0                                /**< Out Of Band data not available. */
#define SEC_PARAM_MIN_KEY_SIZE           7                                /**< Minimum encryption key size. */
#define SEC_PARAM_MAX_KEY_SIZE           16                               /**< Maximum encryption key size. */

#define DEAD_BEEF                        0xDEADBEEF                       /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define OSTIMER_WAIT_FOR_QUEUE           2                                /**< Number of ticks to wait for the timer queue to be ready */

#define APP_FEATURE_NOT_SUPPORTED        BLE_GATT_STATUS_ATTERR_APP_BEGIN + 2        /**< Reply when unsupported features are requested. */

#define UART_TX_BUF_SIZE                256                                         /**< UART TX buffer size. */
#define UART_RX_BUF_SIZE                256                                         /**< UART RX buffer size. */

static uint16_t  m_conn_handle = BLE_CONN_HANDLE_INVALID; /**< Handle of the current connection. */
static ble_bas_t m_bas;                                   /**< Structure used to identify the battery service. */
static ble_nus_t m_nus;                                   /**< Structure to identify the Nordic UART Service. */
static ble_dfu_t m_dfus;     

static uint8_t voice_count = 0;
static uint8_t voice_class = 0;
static uint8_t uart_timeout = 0;
#define SDAH nrf_gpio_pin_write(VOICE_CHIP_PIN, 1)
#define SDAL nrf_gpio_pin_write(VOICE_CHIP_PIN, 0)

static ble_uuid_t m_adv_uuids[] =                         /**< Universally unique service identifiers. */
{
		//{BLE_UUID_NUS_SERVICE, BLE_UUID_TYPE_VENDOR_BEGIN}
    //{BLE_UUID_BATTERY_SERVICE, BLE_UUID_TYPE_BLE},
    {BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE}
};

static TimerHandle_t m_battery_timer;        /**< Definition of battery timer. */
static TimerHandle_t m_voice_timer;
static TimerHandle_t m_uart_timer;
static SemaphoreHandle_t m_ble_event_ready;  /**< Semaphore raised if there is a new event to be processed in the BLE thread. */

static TaskHandle_t m_ble_stack_thread;      /**< Definition of BLE stack thread. */
static TaskHandle_t m_logger_thread;         /**< Definition of Logger thread. */

static void advertising_start(void);

static void uart_onoff(int8_t on)
{
	if(1 == on){
	 NRF_UART0->ENABLE        = (UART_ENABLE_ENABLE_Enabled << UART_ENABLE_ENABLE_Pos);
   NRF_UART0->TASKS_STARTRX = 1;
   NRF_UART0->TASKS_STARTTX = 1;
	}else{
		NRF_UART0->TASKS_STOPTX = 1;
		NRF_UART0->TASKS_STOPRX = 1;
		NRF_UART0->ENABLE       = (UART_ENABLE_ENABLE_Disabled << UART_ENABLE_ENABLE_Pos);
	}
}

static void uart_getline(uint8_t * line,uint32_t timeout)
{
    uint8_t i = 0, ch = 0;
    uint32_t err_code;

		do {
			err_code = app_uart_get(&ch);
			if (NRF_ERROR_NOT_FOUND == err_code)
			{
					//if(timeout-- > 0){
						//nrf_delay_ms(1000);
						sd_app_evt_wait();
					//}else{
						//break;
					//}
			}
			else if (NRF_SUCCESS == err_code)   
			{
				line[i++] = ch;
			}
			else
			{
				APP_ERROR_CHECK(err_code);
			}
		}
		while (ch != '\n');
}

static uint8_t* get_uart_responese(uint8_t * command_buffer)
{
		uart_getline(command_buffer,1);
		
		return command_buffer;
}

static int8_t uart_data_analyze(char *str, int buffer, int timeout)
{
		uint8_t cmd_buffer[10] = {0};
//		time_t start;
//		start = time(NULL);
		timeout = 10;
		while(1){
			get_uart_responese(cmd_buffer);
			if(strstr((const char *)cmd_buffer,(const char *)str) != NULL)
				return 1;
		}
		return -1;
}

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


