flimmy78/MXN003_FACTORY/nRF5_SDK_12.3.0_d7731ad/nRF5_SDK_12.3.0_d7731ad/examples/ble_peripheral/freertos_mxn003/main.c
		return ret_value;	
}

custom_rsp_type_enum custom_modem_version_func(custom_cmdLine *commandBuffer_p){

			PutUARTBytes("AT+EVERN\r\n");
			nrf_delay_ms(100);
			wait_data_reponse(NULL,NULL,"_M",NULL);
			return  CUSTOM_RSP_OK;
}

custom_rsp_type_enum custom_open_gps_func(custom_cmdLine *commandBuffer_p){
		PutUARTBytes("AT+EGPSON");
//		nrf_delay_ms(100);
//		wait_data_reponse("GPS:ON:SUCESS","GPS:ON:FAIL","OK","ERROR");	
		return  CUSTOM_RSP_OK;
}

custom_rsp_type_enum custom_close_gps_func(custom_cmdLine *commandBuffer_p){
		PutUARTBytes("AT+EGPSOFF");
		nrf_delay_ms(100);
//		wait_data_reponse("GPS:OFF:SUCESS","GPS:OFF:FAIL","OK","ERROR");	
		return  CUSTOM_RSP_OK;
}

custom_rsp_type_enum custom_get_gps_data_func(custom_cmdLine *commandBuffer_p){
	PutUARTBytes("AT+EGPSGET");
	nrf_delay_ms(20);
	wait_data_reponse(NULL,NULL,"+LOC","NULL");	
	return  CUSTOM_RSP_OK;
}

const custom_atcmd custom_cmd_table[ ] =
{
	{"AP+RSSI",custom_rssi_func},
	{"AP+VOICE",custom_voice_func},
	{"AP+MOD",custom_mod_func},
	{"AP+SWVER",custom_modem_version_func},
	{"AP+EGPSON",custom_open_gps_func},
	{"AP+EGPSOFF",custom_close_gps_func},
	{"AP+EGPSGET",custom_get_gps_data_func},
	{NULL, NULL}
};

static bool app_data_hdlr(char *full_cmd_string,uint16_t length)
{
		char buffer[20];
//		uint8_t re_Data[] = "OK";
//		uint8_t re_Data1[] = "ERROR";
		char *cmd_name, *cmdString;
		uint8_t index = 0; 
		uint16_t i;
		custom_cmdLine command_line;
		cmd_name = buffer;
		length = length > 20 ? 20 : length;  
	
		while ((full_cmd_string[index] != '=' ) &&  //might be TEST command or EXE command
				(full_cmd_string[index] != '?' ) && // might be READ command
				(full_cmd_string[index] != 13 ) && //carriage return
		index < length)  
		{
			cmd_name[index] = full_cmd_string[index] ;
			index ++;
		}
		cmd_name[index] = '\0' ;  
		
		for (i = 0 ; custom_cmd_table[i].commandString != NULL; i++ )
		{
			cmdString = custom_cmd_table[i].commandString;
			if (strcmp(cmd_name, cmdString) == 0 ){
					strncpy(command_line.character, full_cmd_string, 20);
					command_line.character[19] = '\0';
					command_line.length = strlen(command_line.character);
					command_line.position = index;
					if (custom_cmd_table[i].commandFunc(&command_line) == CUSTOM_RSP_OK) {
							//	ble_nus_string_send(&m_nus, re_Data, sizeof(re_Data));
						}else{
							//	ble_nus_string_send(&m_nus, re_Data1, sizeof(re_Data1));
            }
					return true;
			}
		}
		
		return true;
		
}
/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_nus    Nordic UART Service structure.
 * @param[in] p_data   Data to be send to UART module.
 * @param[in] length   Length of the data.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_t * p_nus, uint8_t * p_data, uint16_t length)
{
	/*收到手机的消息*/
	//进行数据解析		
			uint8_t *data = p_data;
		//	NRF_LOG_INFO("data:%s length:%d\r\n",(uint32_t)p_data,length)
			app_data_hdlr((char *)data, length);
			memset(p_data, 0, sizeof(uint8_t)*length);
//		NRF_LOG_INFO("data:%s    length:%d\r\n",(uint32_t)p_data,length)
//		char *data = (char *)p_data;
//		uint8_t cmd = 0;
//		if(!strncmp(data,"AP+EVERN",length)){
//			cmd = 1;
//		}else if(!strncmp(data,"AP+VOICE",8)){
//			cmd = 2;
//		}else{
//			cmd = 0;
//		}
//		NRF_LOG_INFO("cmd = %d\r\n",cmd);
//		/*发送AT命令*/
//		switch(cmd){
//			case 1:
//				PutUARTBytes("AT+EVERN\r\n");
//				break;
//			case 2:
//					data += 8; length -=8;
//					NRF_LOG_INFO("data = %s length = %d  %d\r\n",(uint32_t)data,length, atoi(data));
//				break;
//			default:
//				break;
//		}
	//	memset(p_data,0,20);
//    for (uint32_t i = 0; i < length; i++)
//    {
//        while (app_uart_put(p_data[i]) != NRF_SUCCESS);
//    }
//    while (app_uart_put('\r') != NRF_SUCCESS);
//    while (app_uart_put('\n') != NRF_SUCCESS);
}
/**@snippet [Handling the data received over BLE] */

static void ble_dfu_evt_handler(ble_dfu_t * p_dfu, ble_dfu_evt_t * p_evt)
{
    switch (p_evt->type)
    {
        case BLE_DFU_EVT_INDICATION_DISABLED:
            NRF_LOG_INFO("Indication for BLE_DFU is disabled\r\n");
            break;

        case BLE_DFU_EVT_INDICATION_ENABLED:
            NRF_LOG_INFO("Indication for BLE_DFU is enabled\r\n");
            break;

        case BLE_DFU_EVT_ENTERING_BOOTLOADER:
            NRF_LOG_INFO("Device is entering bootloader mode!\r\n");
            break;
        default:
            NRF_LOG_INFO("Unknown event from ble_dfu\r\n");
            break;
    }
}

///
void ble_address_change(void)
{
	ble_gap_addr_t ble_addr;
	sd_ble_gap_address_get(&ble_addr);
	ble_addr.addr[0] = 0x99;
	ble_addr.addr[1] = 0x99;
	ble_addr.addr[2] = 0x99;
	ble_addr.addr[3] = 0x99;
	ble_addr.addr[4] = 0x99;
	ble_addr.addr[5] = 0xff;

	sd_ble_gap_address_set(BLE_GAP_ADDR_CYCLE_MODE_NONE,&ble_addr);
}

/**@brief Function for initializing services that will be used by the application.
 *
 * @details Initialize the Heart Rate, Battery and Device Information services.
 */
static void services_init(void)
{
    uint32_t       err_code;
    ble_bas_init_t bas_init;
    ble_dis_init_t dis_init;
		ble_nus_init_t nus_init;
		ble_dfu_init_t dfus_init;
	
	  // Initialize the Device Firmware Update Service.
    memset(&dfus_init, 0, sizeof(dfus_init));

    dfus_init.evt_handler                               = ble_dfu_evt_handler;
    dfus_init.ctrl_point_security_req_write_perm        = SEC_SIGNED;
    dfus_init.ctrl_point_security_req_cccd_write_perm   = SEC_SIGNED;

    err_code = ble_dfu_init(&m_dfus, &dfus_init);
    APP_ERROR_CHECK(err_code);
//    
//	
	 // Initialize nus Service.
		memset(&nus_init, 0, sizeof(nus_init));
		nus_init.data_handler = nus_data_handler;
	
		err_code = ble_nus_init(&m_nus, &nus_init);
    APP_ERROR_CHECK(err_code);

    // Initialize Battery Service.
    memset(&bas_init, 0, sizeof(bas_init));

